// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let num1=+prompt('Введіть число')
// let num2=+prompt('Введіть число')
// if (num1>num2){
//     console.log(num1)
// }
//
//  else if(num1===num2){
//      console.log('Числа рівні')
// }
//  else{console.log(num2)}
// //
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let num=prompt('Який номер квартири?(від 1 до 90)')
// if (num>=1 && num<=20){
//     alert('Ви живете у першому підїзді')
// }
// else if (num>=21 && num<=48){
//     alert('Ви живете у другому підїзді')
// }
// else {
//     alert('Ви живете в третьому підїзді')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть довільне число?')
// if (number===10){
//     alert('ВІРНО!')
// }
// else {alert('Попробуйте ще раз')}
// або
// (+prompt('Введіть число?')===10) ? alert('Вірно') :alert('Попробуйте ще раз')

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x="sadasdasd"
// if (typeof x === 'number') {
//     console.log(1)
//
// }
// else if (typeof x==='string'){
//    console.log(2)
// }
// else if (typeof x==='boolean'){
//     console.log(3)
// }
// else if (typeof x==='object'){
//     console.log(4)
// }
// else{console.log('watman?0_o')}

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let t=+prompt('Яка сьогодні температура?')
// if (t>=10 && t<=22){
//     alert('Ми йдемо ВЧИТИСЯ')
// }
// else {alert('Cидимо вдома і вчимося ОНЛАЙН')}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що
//     число не вірне ... .

// let num=+prompt('Введіть число?від 1 до 5')
//
// switch (num){
//     case 1:
//         alert('ВИ ВИГРАЛИ АВТОМОБІЛЬ!')
//         break
//     case 2:
//         alert('ВИ ВИГРАЛИ МОТОЦИКЛ!')
//         break
//     case 3:
//         alert('ВИ ВИГРАЛИ ТЕЛЕФОН!')
//         break
//     case 4:
//         alert('ВИ ВИГРАЛИ КОЛОНКУ!')
//         break
//     case 5:
//         alert('ВИ ВИГРАЛИ СМАРТ-ГОДИННИК!')
//         break
//     default:
//         alert('Повторіть спробу')
// }

